# YOLOv5 🚀 by Ultralytics, AGPL-3.0 license

# Parameters
nc: 6 # number of classes
depth_multiple: 0.33 # model depth multiple
width_multiple: 0.25 # layer channel multiple
anchors:
  - [10, 13, 16, 30, 33, 23] # P3/8
  - [30, 61, 62, 45, 59, 119] # P4/16
  - [116, 90, 156, 198, 373, 326] # P5/32

# YOLOv5 v6.0 backbone
backbone:
  # [from, number, module, args]
  [
    [-1, 1, Conv, [64, 6, 2, 2]], # 0-P1/2
    [-1, 1, Conv, [128, 3, 2]], # 1-P2/4
    [-1, 3, RepNCSPELAN4_high, [128]],
    [-1, 1, Conv, [256, 3, 2]], # 3-P3/8
    [-1, 6, RepNCSPELAN4_high, [256]],
    [-1, 1, Conv, [512, 3, 2]], # 5-P4/16
    [-1, 9, RepNCSPELAN4_high, [512]],
    [-1, 1, Conv, [1024, 3, 2]], # 7-P5/32
    [-1, 3, RepNCSPELAN4_high, [1024]],
    [-1, 1, AIFI, []], # 9
  ]

# YOLOv5 v6.0 head
head:
  [[4, 1, Conv, [256]],  # 10
   [6, 1, Conv, [256]],  # 11
   [9, 1, Conv, [256]],  # 12

   [-1, 1, nn.Upsample, [None, 2, 'nearest']], # 13 P5->P4
   [[-1, 11], 1, Bi_FPN, []], # 14
   [-1, 3, RepNCSPELAN4_high, [256]], # 15 (T1/8-small)

   [-1, 1, nn.Upsample, [None, 2, 'nearest']], # 16 P4->P3
   [[-1, 10], 1, Bi_FPN, []], # 17
   [-1, 3, RepNCSPELAN4_high, [256]], # 18 (T2/8-small)

   [2, 1, Conv, [256, 3, 2]], # 19
   [[-1, 10, 18], 1, Bi_FPN, []], # 20
   [-1, 3, RepNCSPELAN4_high, [256]], # 21 (T3/8-small)

   [-1, 1, Conv, [256, 3, 2]], # 22
   [[-1, 11, 15], 1, Bi_FPN, []], # 23
   [-1, 3, RepNCSPELAN4_high, [512]], # 24 (T4/16-medium)

   [-1, 1, Conv, [256, 3, 2]], # 25 P4->P5
   [[-1, 12], 1, Bi_FPN, []], # 26
   [-1, 3, RepNCSPELAN4_high, [1024]], # 27 (T5/32-large)

   [[21, 24, 27], 1, DBBHead, [nc, anchors]],  # Detect(P3, P4, P5)
   ]







